
&НаКлиенте
Процедура Показать(Команда)
	ПоказатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоказатьНаСервере()

	ТЗВывод = Новый ТаблицаЗначений();
	ТЗВывод.Колонки.Добавить("AD_Пользователь");
	ТЗВывод.Колонки.Добавить("AD_Группа");
	
	ТЗВывод.Колонки.Добавить("ПользовательИБ");
	ТЗВывод.Колонки.Добавить("ПользовательИБ_Логин");
	
	ТЗВывод.Колонки.Добавить("ПользовательСпр");
	ТЗВывод.Колонки.Добавить("ПользовательСпр_Наименование");
	
//	ТЗВывод.Колонки.Добавить("AD_Группа");
//	ТЗВывод.Колонки.Добавить("AD_Группа");
	
//	ИмяДомена				= л3_СерверПовтИсп.ЗначениеНетиповойКонстанты( "ИмяДомена" ); 
//	ИмяГруппыДоступаКБазе	= л3_СерверПовтИсп.ЗначениеНетиповойКонстанты( "ИмяГруппыДоступаКБазе" ); 
//	ДоменнаяГруппа			= л3_СерверПовтИсп.ЗначениеНетиповойКонстанты( "ДоменнаяГруппа" ); 
//	
//	ИмяПользователя = СтрЗаменить( ПользовательИБПользовательОС, ДоменнаяГруппа, "" );

	СписокПользователейИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для каждого Стр Из СписокПользователейИБ Цикл
		ПользовательИзСправочника = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ", Стр.УникальныйИдентификатор);
		СтрТЗ = ТЗВывод.Добавить();
		СтрТЗ.ПользовательИБ = Стр;
//		СтрТЗ.ПользовательИБ_Логин = Стр;
		СтрТЗ.ПользовательСпр = ПользовательИзСправочника;
		СтрТЗ.ПользовательСпр_Наименование = ПользовательИзСправочника.Наименование;
//		Сообщить("" + Стр + " - " + ПользовательИзСправочника);
	КонецЦикла;
	
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//		"ВЫБРАТЬ
//		|	Пользователи.Ссылка,
//		|	Пользователи.Наименование,
//		|	Пользователи.ИдентификаторПользователяИБ,
//		|	Пользователи.ИдентификаторПользователяСервиса,
//		|	Пользователи.СвойстваПользователяИБ
//		|ИЗ
//		|	Справочник.Пользователи КАК Пользователи";
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		// Вставить обработку выборки ВыборкаДетальныеЗаписи
//	КонецЦикла;
	

КонецПроцедуры
